src/cf/Enums/ТипыУведомленийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыУведомленийМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОРегистрации</Name>
					<Comment>documentAccepted</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбОтказеВРегистрации</Name>
					<Comment>documentRefused</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПостановкеНаКонтроль</Name>
					<Comment>documentSent</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПринятииКИсполнению</Name>
					<Comment>executorAssigned</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПодготовкеДоклада</Name>
					<Comment>reportPrepared</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОНаправленииДоклада</Name>
					<Comment>reportSent</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОХодеИсполнения</Name>
					<Comment>courseChanged</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбОпубликовании</Name>
					<Comment>documentPublished</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыУведомленийМЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Строковое значение для тип уведомления, как оно будет записано в xml-сообщении уведомления. 
// Это фиксированные фразы для xml-сообщения, они не переводятся - НСтр() не нужен.
// 
// Параметры:
//  ТипУведомления - ПеречислениеСсылка.ТипыУведомленийМЭДО - Тип уведомления
// 
// Возвращаемое значение:
//  Строка - Строковое значение для типа уведомления
Функция СтроковоеЗначениеПоЗначению(ТипУведомления) Экспорт
	
	Если ТипУведомления = ОПостановкеНаКонтроль Тогда
		Возврат "Поставлен на контроль"; // documentSent
	ИначеЕсли ТипУведомления = ОРегистрации Тогда
		Возврат "Зарегистрирован"; // documentAccepted
	ИначеЕсли ТипУведомления = ОбОтказеВРегистрации Тогда
		Возврат "Отказано в регистрации"; // documentRefused
	ИначеЕсли ТипУведомления = ОПринятииКИсполнению Тогда 
		Возврат "Назначен исполнитель"; // executorAssigned
	ИначеЕсли ТипУведомления = ОПодготовкеДоклада Тогда 
		Возврат "Доклад подготовлен"; // reportPrepared
	ИначеЕсли ТипУведомления = ОНаправленииДоклада Тогда
		Возврат "Доклад направлен"; // reportSent
	ИначеЕсли ТипУведомления = ОХодеИсполнения Тогда
		Возврат "Исполнение"; // courseChanged
	ИначеЕсли ТипУведомления = ОбОпубликовании Тогда
		Возврат "Опубликование"; // documentPublished
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получить значение перечисления по строковому значению из xml-сообщения-уведомления МЭДО.
// 
// Параметры:
//  СтроковоеЗначение - Строка - Строковое значение из xml
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыУведомленийМЭДО - Соответствующее значение перечисления.
Функция ЗначениеПоСтроковомуЗначению(СтроковоеЗначение) Экспорт
	
	Если СтроковоеЗначение = "Поставлен на контроль" Тогда
		Возврат ОПостановкеНаКонтроль; // documentSent
	ИначеЕсли СтроковоеЗначение = "Зарегистрирован" Тогда
		Возврат ОРегистрации; // documentAccepted
	ИначеЕсли СтроковоеЗначение = "Отказано в регистрации" Тогда
		Возврат ОбОтказеВРегистрации; // documentRefused
	ИначеЕсли СтроковоеЗначение = "Назначен исполнитель" Тогда 
		Возврат ОПринятииКИсполнению; // executorAssigned
	ИначеЕсли СтроковоеЗначение = "Доклад подготовлен" Тогда 
		Возврат ОПодготовкеДоклада; // reportPrepared
	ИначеЕсли СтроковоеЗначение = "Доклад направлен" Тогда
		Возврат ОНаправленииДоклада; // reportSent
	ИначеЕсли СтроковоеЗначение = "Исполнение" Тогда
		Возврат ОХодеИсполнения; // courseChanged
	ИначеЕсли СтроковоеЗначение = "Опубликование" Тогда
		Возврат ОбОпубликовании; // documentPublished
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
